---
kind: property
id: P:Autodesk.Revit.DB.Visual.Noise.NoiseColor2
source: html/f56afd44-bb4a-d6ff-411a-a724445c2954.htm
---
# Autodesk.Revit.DB.Visual.Noise.NoiseColor2 Property

The property labeled "Color 2" from the "Noise" schema.

## Syntax (C#)
```csharp
public static string NoiseColor2 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.